## cloud_asset_inventory
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 5 to add, 3 to change, 5 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.asset_inventory_cartography_state_machine will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "asset_inventory_cartography_state_machine"  {
      ~ id      = "365240692" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "iam:PassRole",
                          - "iam:GetRole",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:iam::794722365809:role/secopsAssetInventoryCartographyRole",
                          - "arn:aws:iam::794722365809:role/cartography_container_execution_role",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = "states:StartExecution"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:states:ca-central-1:794722365809:stateMachine:asset-inventory-cartography"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ecs:ListTasks"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ecs:RunTask"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ecs:ca-central-1:794722365809:task-definition/neo4j_ingestor:5",
                          - "arn:aws:ecs:ca-central-1:794722365809:task-definition/neo4j_ingestor",
                          - "arn:aws:ecs:ca-central-1:794722365809:task-definition/cartography:2",
                          - "arn:aws:ecs:ca-central-1:794722365809:task-definition/cartography",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "events:PutTargets",
                          - "events:PutRule",
                          - "events:DescribeRule",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:events:ca-central-1:794722365809:*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameter",
                          - "ssm:DescribeParameters",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/asset_inventory_account_list"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # data.template_file.asset_inventory_cartography_state_machine will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "asset_inventory_cartography_state_machine"  {
      ~ id       = "2e24b852b92b5b7e5e0c52e17f9f01f8d441f33d2e6e07234899dfd48a5ae328" -> (known after apply)
      ~ rendered = jsonencode(
            {
              - Comment        = "Run daily asset inventory of cloud assets"
              - StartAt        = "Get AWS accounts"
              - States         = {
                  - "Get AWS accounts" = {
                      - Next           = "Map"
                      - Parameters     = {
                          - Name = "/cartography/asset_inventory_account_list"
                        }
                      - Resource       = "arn:aws:states:::aws-sdk:ssm:getParameter"
                      - ResultSelector = {
                          - "accounts.$" = "States.StringToJson($.Parameter.Value)"
                        }
                      - Type           = "Task"
                    }
                  - Map                = {
                      - ItemsPath      = "$.accounts"
                      - Iterator       = {
                          - StartAt = "Pass"
                          - States  = {
                              - Cartography = {
                                  - End        = true
                                  - Parameters = {
                                      - Cluster              = "arn:aws:ecs:ca-central-1:794722365809:cluster/cartography"
                                      - LaunchType           = "FARGATE"
                                      - NetworkConfiguration = {
                                          - AwsvpcConfiguration = {
                                              - SecurityGroups = [
                                                  - "sg-0146ac8de4816d72c",
                                                ]
                                              - Subnets        = [
                                                  - "subnet-009019231e9e7b90c",
                                                ]
                                            }
                                        }
                                      - Overrides            = {
                                          - ContainerOverrides = [
                                              - {
                                                  - Environment = [
                                                      - {
                                                          - Name      = "AWS_ACCOUNT"
                                                          - "Value.$" = "$.account"
                                                        },
                                                      - {
                                                          - Name  = "AWS_CONFIG_FILE"
                                                          - Value = "/config/role_config"
                                                        },
                                                      - {
                                                          - Name  = "NEO4J_URI"
                                                          - Value = "bolt://neo4j.internal.local:7687"
                                                        },
                                                      - {
                                                          - Name  = "NEO4J_USER"
                                                          - Value = "neo4j"
                                                        },
                                                    ]
                                                  - Name        = "cartography"
                                                },
                                            ]
                                        }
                                      - TaskDefinition       = "arn:aws:ecs:ca-central-1:794722365809:task-definition/cartography:2"
                                    }
                                  - Resource   = "arn:aws:states:::ecs:runTask.sync"
                                  - Type       = "Task"
                                }
                              - Pass        = {
                                  - Next       = "Cartography"
                                  - Parameters = {
                                      - "account.$" = "$"
                                    }
                                  - Type       = "Pass"
                                }
                            }
                        }
                      - MaxConcurrency = 1
                      - Next           = "Neo4J Ingestor"
                      - ResultPath     = null
                      - Type           = "Map"
                    }
                  - "Neo4J Ingestor"   = {
                      - End        = true
                      - Parameters = {
                          - Cluster              = "arn:aws:ecs:ca-central-1:794722365809:cluster/neo4j_ingestor"
                          - LaunchType           = "FARGATE"
                          - NetworkConfiguration = {
                              - AwsvpcConfiguration = {
                                  - SecurityGroups = [
                                      - "sg-0146ac8de4816d72c",
                                    ]
                                  - Subnets        = [
                                      - "subnet-009019231e9e7b90c",
                                    ]
                                }
                            }
                          - TaskDefinition       = "arn:aws:ecs:ca-central-1:794722365809:task-definition/neo4j_ingestor:5"
                        }
                      - Resource   = "arn:aws:states:::ecs:runTask.sync"
                      - Type       = "Task"
                    }
                }
              - TimeoutSeconds = 86400
            }
        ) -> (known after apply)
      ~ template = <<-EOT
            {
              "Comment": "Run daily asset inventory of cloud assets",
              "TimeoutSeconds": 86400,
              "StartAt": "Get AWS accounts",
              "States": {
                "Get AWS accounts": {
                  "Type": "Task",
                  "Next": "Map",
                  "Parameters": {
                    "Name": "/cartography/asset_inventory_account_list"
                  },
                  "Resource": "arn:aws:states:::aws-sdk:ssm:getParameter",
                  "ResultSelector": {
                    "accounts.$": "States.StringToJson($.Parameter.Value)"
                  }
                },
                "Map": {
                  "Type": "Map",
                  "Iterator": {
                    "StartAt": "Pass",
                    "States": {
                      "Pass": {
                        "Type": "Pass",
                        "Next": "Cartography",
                        "Parameters": {
                          "account.$": "$"
                        }
                      },
                      "Cartography": {
                        "Type": "Task",
                        "Resource": "arn:aws:states:::ecs:runTask.sync",
                        "Parameters": {
                          "LaunchType": "FARGATE",
                          "Cluster": "${CARTOGRAPHY_CLUSTER}",
          +               "CapacityProviderStrategy": [
          +                 {
          +                   "Base": ${MIN_ECS_CAPACITY},
          +                   "CapacityProvider": "FARGATE_SPOT",
          +                   "Weight": ${MAX_ECS_CAPACITY}
          +                 },
          +                 {
          +                   "Base": 0,
          +                   "CapacityProvider": "FARGATE",
          +                   "Weight": ${MIN_ECS_CAPACITY}
          +                 }
          +               ],
                          "TaskDefinition": "${CARTOGRAPHY_TASK_DEF}",
                          "Overrides": {
                            "ContainerOverrides": [
                              {
                                "Name": "${CARTOGRAPHY_CONTAINER_NAME}",
                                "Environment": [
                                  {
                                    "Name": "AWS_ACCOUNT",
                                    "Value.$": "$.account"
                                  },
                                  {
                                    "Name": "AWS_CONFIG_FILE",
                                    "Value": "/config/role_config"
                                  },
                                  {
                                    "Name": "NEO4J_URI",
                                    "Value": "bolt://neo4j.internal.local:7687"
                                  },
                                  {
                                    "Name": "NEO4J_USER",
                                    "Value": "neo4j"
                                  }
                                ]
                              }
                            ]
                          },
                          "NetworkConfiguration": {
                            "AwsvpcConfiguration": {
                              "SecurityGroups": ["${SECURITY_GROUPS}"],
                              "Subnets":["${SUBNETS}"]
                            }
                          }
                        },
                        "End": true
                      }
                    }
                  },
                  "MaxConcurrency": 1,
                  "ItemsPath": "$.accounts",
                  "ResultPath": null,
                  "Next": "Neo4J Ingestor"
                },
                "Neo4J Ingestor": {
                  "Type": "Task",
                  "Resource": "arn:aws:states:::ecs:runTask.sync",
                  "Parameters": {
                    "LaunchType": "FARGATE",
                    "Cluster" : "${NEO4J_INGESTOR_CLUSTER}",
          +         "CapacityProviderStrategy": [
          +           {
          +             "Base": ${MIN_ECS_CAPACITY},
          +             "CapacityProvider": "FARGATE_SPOT",
          +             "Weight": ${MAX_ECS_CAPACITY}
          +           },
          +           {
          +             "Base": 0,
          +             "CapacityProvider": "FARGATE",
          +             "Weight": ${MIN_ECS_CAPACITY}
          +           }
          +         ],
                    "TaskDefinition" : "${NEO4J_INGESTOR_TASK_DEF}",
                    "NetworkConfiguration": {
                      "AwsvpcConfiguration": {
                        "SecurityGroups": ["${SECURITY_GROUPS}"],
                        "Subnets": ["${SUBNETS}"]
                      }
                    }
                  },
                  "End": true
                }
              }
            }
        EOT
      ~ vars     = {
          ~ "CARTOGRAPHY_CLUSTER"        = "arn:aws:ecs:ca-central-1:794722365809:cluster/cartography" -> (known after apply)
          + "MAX_ECS_CAPACITY"           = "5"
          + "MIN_ECS_CAPACITY"           = "1"
          ~ "NEO4J_INGESTOR_CLUSTER"     = "arn:aws:ecs:ca-central-1:794722365809:cluster/neo4j_ingestor" -> (known after apply)
            # (5 unchanged elements hidden)
        }
    }

  # aws_ecs_cluster.cartography will be destroyed
  # (because aws_ecs_cluster.cartography is not in configuration)
  - resource "aws_ecs_cluster" "cartography" {
      - arn                = "arn:aws:ecs:ca-central-1:794722365809:cluster/cartography" -> null
      - capacity_providers = [] -> null
      - id                 = "arn:aws:ecs:ca-central-1:794722365809:cluster/cartography" -> null
      - name               = "cartography" -> null
      - tags               = {
          - "CostCentre" = "security-tools-794722365809"
          - "Product"    = "security-tools-cloud-asset-inventory"
          - "Terraform"  = "true"
        } -> null
      - tags_all           = {
          - "CostCentre" = "security-tools-794722365809"
          - "Product"    = "security-tools-cloud-asset-inventory"
          - "Terraform"  = "true"
        } -> null

      - setting {
          - name  = "containerInsights" -> null
          - value = "enabled" -> null
        }
    }

  # aws_ecs_cluster.cloud_asset_discovery will be created
  + resource "aws_ecs_cluster" "cloud_asset_discovery" {
      + arn                = (known after apply)
      + capacity_providers = (known after apply)
      + id                 = (known after apply)
      + name               = "cloud_asset_discovery"
      + tags               = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      + tags_all           = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }

      + default_capacity_provider_strategy {
          + base              = (known after apply)
          + capacity_provider = (known after apply)
          + weight            = (known after apply)
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # aws_ecs_cluster.neo4j will be destroyed
  # (because aws_ecs_cluster.neo4j is not in configuration)
  - resource "aws_ecs_cluster" "neo4j" {
      - arn                = "arn:aws:ecs:ca-central-1:794722365809:cluster/neo4j" -> null
      - capacity_providers = [] -> null
      - id                 = "arn:aws:ecs:ca-central-1:794722365809:cluster/neo4j" -> null
      - name               = "neo4j" -> null
      - tags               = {
          - "CostCentre" = "security-tools-794722365809"
          - "Product"    = "security-tools-cloud-asset-inventory"
          - "Terraform"  = "true"
        } -> null
      - tags_all           = {
          - "CostCentre" = "security-tools-794722365809"
          - "Product"    = "security-tools-cloud-asset-inventory"
          - "Terraform"  = "true"
        } -> null

      - setting {
          - name  = "containerInsights" -> null
          - value = "enabled" -> null
        }
    }

  # aws_ecs_cluster.neo4j_ingestor will be destroyed
  # (because aws_ecs_cluster.neo4j_ingestor is not in configuration)
  - resource "aws_ecs_cluster" "neo4j_ingestor" {
      - arn                = "arn:aws:ecs:ca-central-1:794722365809:cluster/neo4j_ingestor" -> null
      - capacity_providers = [] -> null
      - id                 = "arn:aws:ecs:ca-central-1:794722365809:cluster/neo4j_ingestor" -> null
      - name               = "neo4j_ingestor" -> null
      - tags               = {
          - "CostCentre" = "security-tools-794722365809"
          - "Product"    = "security-tools-cloud-asset-inventory"
          - "Terraform"  = "true"
        } -> null
      - tags_all           = {
          - "CostCentre" = "security-tools-794722365809"
          - "Product"    = "security-tools-cloud-asset-inventory"
          - "Terraform"  = "true"
        } -> null

      - setting {
          - name  = "containerInsights" -> null
          - value = "enabled" -> null
        }
    }

  # aws_ecs_service.neo4j must be replaced
-/+ resource "aws_ecs_service" "neo4j" {
      ~ cluster                            = "arn:aws:ecs:ca-central-1:794722365809:cluster/neo4j" -> (known after apply) # forces replacement
      ~ iam_role                           = "aws-service-role" -> (known after apply)
      ~ id                                 = "arn:aws:ecs:ca-central-1:794722365809:service/neo4j/neo4j" -> (known after apply)
        name                               = "neo4j"
      ~ platform_version                   = "LATEST" -> (known after apply)
      - propagate_tags                     = "NONE" -> null
        tags                               = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-cloud-asset-inventory"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:794722365809:task-definition/neo4j:7" -> (known after apply)
        # (10 unchanged attributes hidden)

      - deployment_circuit_breaker {
          - enable   = false -> null
          - rollback = false -> null
        }

      - deployment_controller {
          - type = "ECS" -> null
        }



      ~ service_registries {
          - container_port = 0 -> null
          - port           = 0 -> null
            # (1 unchanged attribute hidden)
        }
        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.neo4j must be replaced
-/+ resource "aws_ecs_task_definition" "neo4j" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:794722365809:task-definition/neo4j:7" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  - cpu              = 0 -> null
                  ~ mountPoints      = [
                      + {
                          + containerPath = "/var/lib/neo4j/data"
                          + readOnly      = false
                          + sourceVolume  = "neo4j-efs-volume"
                        },
                    ]
                    name             = "neo4j"
                  - volumesFrom      = [] -> null
                    # (7 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "neo4j" -> (known after apply)
      ~ revision                 = 7 -> (known after apply)
        tags                     = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-cloud-asset-inventory"
            "Terraform"  = "true"
        }
        # (9 unchanged attributes hidden)

      + volume { # forces replacement
          + name = "neo4j-efs-volume"

          + efs_volume_configuration {
              + file_system_id = (known after apply)
              + root_directory = "/"
            }
        }
    }

  # aws_efs_file_system.neo4j will be created
  + resource "aws_efs_file_system" "neo4j" {
      + arn                     = (known after apply)
      + availability_zone_id    = (known after apply)
      + availability_zone_name  = (known after apply)
      + creation_token          = (known after apply)
      + dns_name                = (known after apply)
      + encrypted               = (known after apply)
      + id                      = (known after apply)
      + kms_key_id              = (known after apply)
      + number_of_mount_targets = (known after apply)
      + owner_id                = (known after apply)
      + performance_mode        = (known after apply)
      + size_in_bytes           = (known after apply)
      + tags                    = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      + tags_all                = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      + throughput_mode         = "bursting"
    }

  # aws_efs_mount_target.neo4j[0] will be created
  + resource "aws_efs_mount_target" "neo4j" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = (known after apply)
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = [
          + "sg-0146ac8de4816d72c",
        ]
      + subnet_id              = "subnet-009019231e9e7b90c"
    }

  # aws_iam_policy.asset_inventory_cartography_state_machine will be updated in-place
  ~ resource "aws_iam_policy" "asset_inventory_cartography_state_machine" {
        id        = "arn:aws:iam::794722365809:policy/CartographyStateMachineECSLambda"
        name      = "CartographyStateMachineECSLambda"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "iam:PassRole",
                          - "iam:GetRole",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:iam::794722365809:role/secopsAssetInventoryCartographyRole",
                          - "arn:aws:iam::794722365809:role/cartography_container_execution_role",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = "states:StartExecution"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:states:ca-central-1:794722365809:stateMachine:asset-inventory-cartography"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ecs:ListTasks"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ecs:RunTask"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ecs:ca-central-1:794722365809:task-definition/neo4j_ingestor:5",
                          - "arn:aws:ecs:ca-central-1:794722365809:task-definition/neo4j_ingestor",
                          - "arn:aws:ecs:ca-central-1:794722365809:task-definition/cartography:2",
                          - "arn:aws:ecs:ca-central-1:794722365809:task-definition/cartography",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "events:PutTargets",
                          - "events:PutRule",
                          - "events:DescribeRule",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:events:ca-central-1:794722365809:*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameter",
                          - "ssm:DescribeParameters",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/asset_inventory_account_list"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # aws_security_group.cartography will be updated in-place
  ~ resource "aws_security_group" "cartography" {
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "10.0.11.0/24",
                ]
              + description      = "Allow NFS traffic into mount target from ECS"
              + from_port        = 2049
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 2049
            },
            # (3 unchanged elements hidden)
        ]
        id                     = "sg-0146ac8de4816d72c"
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "10.0.11.0/24",
                ]
              - description      = "Access to efs"
              - from_port        = 2049
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 2049
            },
          + {
              + cidr_blocks      = [
                  + "10.0.11.0/24",
                ]
              + description      = "Allow NFS traffic out from ECS to mount target"
              + from_port        = 2049
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 2049
            },
            # (4 unchanged elements hidden)
        ]
        name                   = "cartography"
        tags                   = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-cloud-asset-inventory"
            "Terraform"  = "true"
        }
        # (6 unchanged attributes hidden)
    }

  # aws_sfn_state_machine.asset_inventory_cartography will be updated in-place
  ~ resource "aws_sfn_state_machine" "asset_inventory_cartography" {
      ~ definition    = jsonencode(
            {
              - Comment        = "Run daily asset inventory of cloud assets"
              - StartAt        = "Get AWS accounts"
              - States         =...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.asset_inventory_cartography"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.asset_inventory_cartography_state_machine"]

19 tests, 17 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
